controllers/SiswaController.php

SELECT COUNT(*) FROM `tbl_siswa`
SELECT * FROM `tbl_siswa` ORDER BY `nama` LIMIT 5
---
    public function actionIndex()
    {
        $query = Siswa::find();

        $pagination = new Pagination([
            'defaultPageSize' => 5,
            'totalCount' => $query->count(),
        ]);

        $siswa = $query->orderBy('nama')
            ->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();

INSERT INTO `tbl_siswa` (`nama`, `kelas`, `alamat`) VALUES ('nama1', 'kelas1', 'alamat1')
---
    public function actionCreate()
    {
        $model = new Siswa();
        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `tbl_siswa` WHERE `id`='1'
UPDATE `tbl_siswa` SET `alamat`='alamat_1' WHERE `id`=1
---
    public function actionUpdate($id)
    {
        $model = Siswa::findOne($id);
        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `tbl_siswa` WHERE `id`='1'
---
    public function actionView($id)
    {
        $model = Siswa::findOne($id);